## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_key_vault_secret.fatpdbconnectionstring will be updated in-place
  ~ resource "azurerm_key_vault_secret" "fatpdbconnectionstring" {
        id                      = "https://find-a-tp-pr-353-kv.vault.azure.net/secrets/ConnectionStrings--FatpDatabase/4773c4f1500f471dac345f127c5f6e68"
        name                    = "ConnectionStrings--FatpDatabase"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.fatpredisconnectionstring will be updated in-place
  ~ resource "azurerm_key_vault_secret" "fatpredisconnectionstring" {
        id                      = "https://find-a-tp-pr-353-kv.vault.azure.net/secrets/ConnectionStrings--FatpRedis/eff540c42a1c47cbbf43e2b7ee7b83da"
        name                    = "ConnectionStrings--FatpRedis"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_postgresql_flexible_server.default must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "default" {
      ~ fqdn                          = "find-a-tp-psqlflexible-server.postgres.database.azure.com" -> (known after apply)
      ~ id                            = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.DBforPostgreSQL/flexibleServers/find-a-tp-psqlflexible-server" -> (known after apply)
      ~ name                          = "find-a-tp-psqlflexible-server" -> "find-a-tp-pr-353-psqlflexible-server" # forces replacement
      + private_dns_zone_id           = (known after apply)
      ~ public_network_access_enabled = true -> (known after apply)
        tags                          = {
            "Environment"      = "pr-353"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
      - zone                          = "1" -> null
        # (9 unchanged attributes hidden)

      - authentication {
          - active_directory_auth_enabled = false -> null
          - password_auth_enabled         = true -> null
        }
    }

  # azurerm_postgresql_flexible_server_configuration.default must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "default" {
      ~ id        = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.DBforPostgreSQL/flexibleServers/find-a-tp-psqlflexible-server/configurations/azure.extensions" -> (known after apply)
        name      = "azure.extensions"
      ~ server_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.DBforPostgreSQL/flexibleServers/find-a-tp-psqlflexible-server" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # azurerm_postgresql_flexible_server_database.default must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "default" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.DBforPostgreSQL/flexibleServers/find-a-tp-psqlflexible-server/databases/find-a-tp-db" -> (known after apply)
      ~ name      = "find-a-tp-db" -> "find-a-tp-pr-353-db" # forces replacement
      ~ server_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.DBforPostgreSQL/flexibleServers/find-a-tp-psqlflexible-server" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # azurerm_postgresql_flexible_server_firewall_rule.firewall_rule["s177d01-ntp-PSQL-fwrule"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_firewall_rule" "firewall_rule" {
      ~ id               = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.DBforPostgreSQL/flexibleServers/find-a-tp-psqlflexible-server/firewallRules/s177d01-ntp-PSQL-fwrule" -> (known after apply)
        name             = "s177d01-ntp-PSQL-fwrule"
      ~ server_id        = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.DBforPostgreSQL/flexibleServers/find-a-tp-psqlflexible-server" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # azurerm_redis_cache.default must be replaced
-/+ resource "azurerm_redis_cache" "default" {
      ~ hostname                      = "find-a-tp-redis-cache.redis.cache.windows.net" -> (known after apply)
      ~ id                            = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Cache/redis/find-a-tp-redis-cache" -> (known after apply)
      ~ name                          = "find-a-tp-redis-cache" -> "find-a-tp-pr-353-redis-cache" # forces replacement
      ~ port                          = 6379 -> (known after apply)
      ~ primary_access_key            = (sensitive value)
      ~ primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      ~ redis_version                 = "6.0" -> "6"
      ~ replicas_per_master           = 0 -> (known after apply)
      ~ replicas_per_primary          = 0 -> (known after apply)
      ~ secondary_access_key          = (sensitive value)
      ~ secondary_connection_string   = (sensitive value)
      - shard_count                   = 0 -> null
      ~ ssl_port                      = 6380 -> (known after apply)
        tags                          = {
            "Environment"      = "pr-353"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
      - tenant_settings               = {} -> null
      - zones                         = [] -> null
        # (8 unchanged attributes hidden)

      ~ redis_configuration {
          - aof_backup_enabled              = false -> null
          ~ maxclients                      = 256 -> (known after apply)
          ~ maxfragmentationmemory_reserved = 30 -> (known after apply)
          ~ maxmemory_delta                 = 30 -> (known after apply)
          ~ maxmemory_reserved              = 30 -> (known after apply)
          - rdb_backup_enabled              = false -> null
          - rdb_backup_frequency            = 0 -> null
          - rdb_backup_max_snapshot_count   = 0 -> null
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_resource_group.default[0] will be updated in-place
  ~ resource "azurerm_resource_group" "default" {
        id       = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353"
        name     = "s177d01-ntp-pr-353"
      ~ tags     = {
          ~ "Environment"      = "Dev" -> "pr-353"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (1 unchanged attribute hidden)
    }

Plan: 5 to add, 3 to change, 5 to destroy.
```
</details>